In [2]:
import pandas as pd
from sqlalchemy import create_engine, text
engine = create_engine("mysql+mysqlconnector://root:abc@127.0.0.1:3306/cs544")
conn = engine.connect()

# https://github.com/cfpb/api/tree/master/resources/datasets/hmda/code_sheets
loan_cols = ["lei", "action_taken", "loan_type", "loan_amount", "interest_rate", "loan_purpose", "income"]

In [4]:
# TODO: manually create accounts and users table

In [6]:
# list(conn.execute(text("select * from accounts")))

In [7]:
# pd.read_sql(text("select * from accounts"), conn)

In [8]:
df = pd.read_csv("https://raw.githubusercontent.com/cfpb/api/master/resources/datasets/hmda/code_sheets/action_taken.csv")
df.to_sql("actions", conn, index=False, if_exists="replace")

8

In [9]:
df = pd.read_csv("https://raw.githubusercontent.com/cfpb/api/master/resources/datasets/hmda/code_sheets/loan_type.csv")
df.to_sql("loan_type", conn, index=False, if_exists="replace")

4

In [10]:
df = pd.read_csv("https://raw.githubusercontent.com/cfpb/api/master/resources/datasets/hmda/code_sheets/loan_purpose.csv")
df.to_sql("purposes", conn, index=False, if_exists="replace")

3

In [11]:
pd.read_sql(text("select * from purposes"), conn)

   id      loan_purpose
0   1     Home purchase
1   2  Home improvement
2   3       Refinancing

In [12]:
df = pd.read_parquet("loans.parquet", columns=loan_cols)
df.head()

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,54930034MNPILHP25H80,6,1,305000.0,3.875,1,108.0
1,54930034MNPILHP25H80,4,1,65000.0,None,1,103.0
2,54930034MNPILHP25H80,6,1,75000.0,3.25,1,146.0
3,54930034MNPILHP25H80,1,1,155000.0,4.0,32,70.0
4,54930034MNPILHP25H80,1,1,305000.0,3.25,1,71.0

In [13]:
len(df)

447367

In [14]:
df.to_sql("loans", conn, chunksize=1000, index=False, if_exists="replace")

447367

In [3]:
conn.commit()

# Transactions

In [23]:
conn.execute(text("""
update accounts set amount = amount - 6
WHERE name = 'A'
"""))

In [24]:
conn.execute(text("""
update accounts set amount = amount + 6
WHERE name = 'B'
"""))

In [25]:
rows = list(conn.execute(text("select amount from accounts where name='A'")))
if rows[0][0] >= 0:
    conn.commit()
    print("transaction complete")
else:
    conn.rollback()
    print("transaction failed")

transaction failed

# Query Practice

In [5]:
# what are the first 10 loans?  Practice LIMIT.
pd.read_sql(text("""
SELECT *
FROM loans
LIMIT 10;
"""), conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,54930034MNPILHP25H80,6,1,305000.0,3.875,1,108.0
1,54930034MNPILHP25H80,4,1,65000.0,None,1,103.0
2,54930034MNPILHP25H80,6,1,75000.0,3.25,1,146.0
3,54930034MNPILHP25H80,1,1,155000.0,4.0,32,70.0
4,54930034MNPILHP25H80,1,1,305000.0,3.25,1,71.0
5,54930034MNPILHP25H80,1,1,175000.0,3.375,1,117.0
6,54930034MNPILHP25H80,1,1,575000.0,4.5,1,180.0
7,54930034MNPILHP25H80,1,1,105000.0,5.375,1,180.0
8,54930034MNPILHP25H80,1,1,85000.0,3.375,1,136.0
9,549300FQ2SN6TRRGB032,1,1,405000.0,Exempt,1,NaN

In [ ]:
# projection: choosing what columns (SELECT)

In [ ]:
# selection: filtering rows (WHERE)

In [17]:
# what are the first 10 interest rates and loan amounts (in thousands)?  Practice SELECT.
pd.read_sql(text("""
SELECT interest_rate, (loan_amount / 1000) AS loan_thousands
FROM loans
LIMIT 10;
"""), conn)

  interest_rate  loan_thousands
0         3.875           305.0
1          None            65.0
2          3.25            75.0
3           4.0           155.0
4          3.25           305.0
5         3.375           175.0
6           4.5           575.0
7         5.375           105.0
8         3.375            85.0
9        Exempt           405.0

In [18]:
# what are the loans for individuals with income over $1 million?  Practice WHERE.
pd.read_sql(text("""
SELECT *
FROM loans
WHERE income >= 1000000
"""), conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,254900IER2H3R8YLBW04,1,1,105000.0,2.875,31,1530000.0
1,3Y4U8VZURTYWI1W2K376,3,1,7455000.0,None,4,94657029.0
2,549300CS1XP28EERR469,1,1,75000.0,4.99,4,2030000.0
3,549300CS1XP28EERR469,1,1,205000.0,3.75,1,7291000.0

In [8]:
# what are the five biggest loans in terms of dollar amount?  Practice ORDER BY.
pd.read_sql(text("""
SELECT *
FROM loans
ORDER BY loan_amount DESC
LIMIT 5
"""), conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,549300XWUSRVVOHPRY47,6,1,264185000.0,None,1,None
1,AD6GFRVSDT01YPT1CS68,1,1,74755000.0,1.454,1,None
2,AD6GFRVSDT01YPT1CS68,4,2,66005000.0,None,1,None
3,YQI2CPR3Z44KAR0HG822,1,1,65005000.0,3.0,1,None
4,254900YA1AQXNM8QVZ06,1,2,63735000.0,2.99,2,None

In [26]:
# what are the actions taken and types for those loans (show the text, not numbers)?  Practice INNER JOIN.

In [12]:
pd.read_sql(text("""
SELECT *
FROM loan_type
"""), conn)

   id           loan_type
0   1        Conventional
1   2         FHA-insured
2   3       VA-guaranteed
3   4  FSA/RHS-guaranteed

In [16]:
pd.read_sql(text("""
SELECT lei, loan_amount, interest_rate, income, actions.action_taken, loan_type.loan_type
FROM loans
INNER JOIN actions ON loans.action_taken = actions.id
INNER JOIN loan_type ON loans.loan_type = loan_type.id
ORDER BY loan_amount DESC
LIMIT 5
"""), conn)

,lei,loan_amount,interest_rate,income,action_taken,loan_type
0,549300XWUSRVVOHPRY47,264185000.0,None,None,Loan purchased by the institution,Conventional
1,AD6GFRVSDT01YPT1CS68,74755000.0,1.454,None,Loan originated,Conventional
2,AD6GFRVSDT01YPT1CS68,66005000.0,None,None,Application withdrawn by applicant,FHA-insured
3,YQI2CPR3Z44KAR0HG822,65005000.0,3.0,None,Loan originated,Conventional
4,254900YA1AQXNM8QVZ06,63735000.0,2.99,None,Loan originated,FHA-insured

In [26]:
# what is a loan_purpose that doesn't appear in the loans table?  Practice LEFT/RIGHT JOIN.

In [22]:
pd.read_sql(text("""
SELECT *
FROM purposes
LEFT JOIN loans ON purposes.id = loans.loan_purpose
WHERE loans.loan_purpose IS NULL
"""), conn)

Empty DataFrame
Columns: [id, loan_purpose, lei, action_taken, loan_type, loan_amount, interest_rate, loan_purpose, income]
Index: []

In [19]:
pd.read_sql(text("""
SELECT *
FROM loans
LIMIT 10
"""), conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,54930034MNPILHP25H80,6,1,305000.0,3.875,1,108.0
1,54930034MNPILHP25H80,4,1,65000.0,None,1,103.0
2,54930034MNPILHP25H80,6,1,75000.0,3.25,1,146.0
3,54930034MNPILHP25H80,1,1,155000.0,4.0,32,70.0
4,54930034MNPILHP25H80,1,1,305000.0,3.25,1,71.0
5,54930034MNPILHP25H80,1,1,175000.0,3.375,1,117.0
6,54930034MNPILHP25H80,1,1,575000.0,4.5,1,180.0
7,54930034MNPILHP25H80,1,1,105000.0,5.375,1,180.0
8,54930034MNPILHP25H80,1,1,85000.0,3.375,1,136.0
9,549300FQ2SN6TRRGB032,1,1,405000.0,Exempt,1,NaN

In [27]:
# how many rows are in the table?  Practice COUNT(*).
pd.read_sql(text("""
SELECT COUNT(*)
FROM loans
"""), conn)

   COUNT(*)
0    447367

In [28]:
# how many non-null values are in the income column?  Practice COUNT(column).

In [29]:
pd.read_sql(text("""
SELECT COUNT(income)
FROM loans
"""), conn)

   COUNT(income)
0         399948

In [26]:
# what is the average interest rate for loans of type "Conventional"?  Practice AVG.

In [31]:
pd.read_sql(text("""
SELECT COUNT(*)
FROM loans
INNER JOIN actions ON loans.action_taken = actions.id
INNER JOIN loan_type ON loans.loan_type = loan_type.id
WHERE loan_type.loan_type = 'Conventional'
"""), conn)

   COUNT(*)
0    389217

In [26]:
# how many loans are there of each type?  Practice GROUP BY.

In [33]:
pd.read_sql(text("""
SELECT loan_type.loan_type, COUNT(*)
FROM loans
INNER JOIN actions ON loans.action_taken = actions.id
INNER JOIN loan_type ON loans.loan_type = loan_type.id
GROUP BY loan_type.loan_type
"""), conn)

            loan_type  COUNT(*)
0        Conventional    389217
1       VA-guaranteed     24551
2         FHA-insured     30496
3  FSA/RHS-guaranteed      3103

In [34]:
# which loan types appear at least 10,000 times?  Practice HAVING.
pd.read_sql(text("""
SELECT loan_type.loan_type, COUNT(*) as total
FROM loans
INNER JOIN actions ON loans.action_taken = actions.id
INNER JOIN loan_type ON loans.loan_type = loan_type.id
GROUP BY loan_type.loan_type
HAVING total >= 10000
"""), conn)

       loan_type   total
0   Conventional  389217
1  VA-guaranteed   24551
2    FHA-insured   30496

In [36]:
import time

In [40]:
# how many loans are between $10K and 20K?  Practice BETWEEN.
# which loan types appear at least 10,000 times?  Practice HAVING.
t0 = time.time()
result = pd.read_sql(text("""
SELECT COUNT(*)
FROM loans
WHERE loan_amount BETWEEN 10000 and 20000
"""), conn)
t1 = time.time()
print((t1-t0)*1000, "milliseconds")
result

236.25946044921875 milliseconds

   COUNT(*)
0      5984

In [26]:
# how fast is the above query with and without a BTREE index?  Practice indexing.

In [41]:
conn.execute(text("CREATE INDEX loan_amount_idx USING BTREE ON loans(loan_amount)"))

In [44]:
t0 = time.time()
result = pd.read_sql(text("""
SELECT COUNT(*)
FROM loans
WHERE loan_amount BETWEEN 10000 and 20000
"""), conn)
t1 = time.time()
print((t1-t0)*1000, "milliseconds")
result

8.247137069702148 milliseconds

   COUNT(*)
0      5984

In [26]:
# how many loans are there of each type?

In [26]:
# which loan types appear at least 10,000 times?

In [26]:
# how many loans are between $10K and 20K?

In [26]:
# how fast is the above query with and without a BTREE index?